# budget.py

# Иванчо събира пари за книги по програмиране. Има и списък с книгите, които иска да вземе, 
# обаче не е сигурен в две неща:

# Колко най-много книги ще може да вземе със своя бюджет
# Колко кредит ще трябва да изтегли, за да може да вземе останалите книги, извън бюджета му.
# Във файла budget.py, напишете функцията on_budget(books, budget), където:

# books е списък от цели числа - цените на книгите от списъка на Иванчо. 
# В списъка може да има безплатни книги, отбелязани с цена 0.
# budget е цяло число - бюджета на Иванчо.
# Функцията трябва да върне речник, който има два ключа:

# "books_on_budget" - като стойност на този ключ трябва да стои максималната бройка на 
# книги, които Иванчо може да си купи с дадения budget
# "loan" - стойността на този ключ са парите, които Иванчо трябва да вземе, 
# за да може да си купи всички останали книги от списъка, които са извън неговия бюджет, 
# след като е взем максималната бройка преди това.

def on_budget(books, budget):
    result = {
        "books_on_budget": 0,
        "loan": 0
    }

    books_cost = sum(books)

    books = sorted(books)

    if books_cost > budget:
        result["loan"] = books_cost - budget

    while budget >= 0:
        for book in books:
            budget -= book

            if budget < 0:
                break

            result["books_on_budget"] += 1

    return result

# print(on_budget([12, 1, 0, 5, 7, 25, 29], 25))

